//
//	XModel.h
//		Author:HIROMASA IKEDA	DATE:2018/10/19
//===============================================
//	変更者 Changed By
//		Name:	DATE:
//
//-----------------------------------------------

#pragma once
#ifndef IKEDA_TEMPSOURCE_H
#define IKEDA_TEMPSOURCE_H

//================================================
//	インクルード	include
//================================================
#include"common.h"
#include<d3dx9.h>

//================================================
//	マクロ定義	define
//================================================
#define MODEL_FILENAME_MAX (64)

//================================================
//	列挙型		enum
//================================================


//================================================
//	構造体		struct/typedef
//================================================


//================================================
//	グローバル変数　global
//================================================


//================================================
//	関数		function
//================================================
void XModel_Initialize(const char pFileName[MODEL_FILENAME_MAX]);	//初期化
void XModel_Finalize();		//終了

void XModel_Load();		//モデル読み込み
void XModel_Render();	//描画



#endif